#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details>
  <summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`success`

<details>
  <summary>Show Plan</summary>

  ```

  terraform
cloudflare_record.oldbigbuddhadev_txt_dmarc: Refreshing state... [id=8cd213e2c5c82010a58e787fcaa17fa2]
cloudflare_record.ojilabcloud_txt_root_googlesiteverification: Refreshing state... [id=d287e1bceb9844e362caffefcc302e0c]
cloudflare_record.ojilabcloud_txt_access_demo: Refreshing state... [id=b6973f3066c3bee885f4a63848ed8ae0]
cloudflare_record.oldbigbuddhanet_mx_root4: Refreshing state... [id=23579f1f7528a189e305e54eaf4d7e8e]
cloudflare_record.oldbigbuddhadev_mx_root4: Refreshing state... [id=48dc2885839ba8899422a132c6c1f01c]
cloudflare_record.oldbigbuddhadev_txt_root_openai: Refreshing state... [id=b74813888f04d8cc727452071243ee65]
cloudflare_record.oldbigbuddhadev_txt_discord: Refreshing state... [id=9b88a27062c23df7c2a355a1dc3abb51]
cloudflare_record.roppojsondev_a_root2: Refreshing state... [id=e2ae33112698aebc591a12a52a9b3759]
cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification: Refreshing state... [id=fbdabdb7d24c316c7eedae91bfc67186]
cloudflare_record.oldbigbuddhanet_mx_root1: Refreshing state... [id=19b658250e60965e6e431cba8b28b838]
cloudflare_record.oldbigbuddhanet_mx_root2: Refreshing state... [id=90407ffc481f9c7f4772fa1031d98979]
cloudflare_record.oldbigbuddhadev_txt_atproto: Refreshing state... [id=708759efed68da7264a89b3bce88c1dd]
cloudflare_record.oldbigbuddhadev_a_wp: Refreshing state... [id=c50d7bb0179b8ddb2192aea6bdd6349f]
cloudflare_record.roppojsondev_a_root1: Refreshing state... [id=1afef8ec193641cbb4c48180888b2c69]
cloudflare_record.oldbigbuddhanet_cname_root: Refreshing state... [id=5d527e1ad96ef0c3dd0e64d8387c67e1]
cloudflare_record.record["f887b3adea226972affc939e06efab29.3"]: Refreshing state... [id=fabc8f7927b54fdae4c635ffc07ea8a2]
cloudflare_record.oldbigbuddhanet_txt_root_keybase: Refreshing state... [id=147204b239788f0b354ba270cae932b9]
cloudflare_record.record["f887b3adea226972affc939e06efab29.0"]: Refreshing state... [id=54e00588c994e9d4d8b834048ddc3483]
cloudflare_record.record["f887b3adea226972affc939e06efab29.1"]: Refreshing state... [id=8c9d207c65067164576e838625aaa953]
cloudflare_record.record["f887b3adea226972affc939e06efab29.2"]: Refreshing state... [id=5c150b0fee7e7dd89a811ed37144b936]
cloudflare_record.record["f887b3adea226972affc939e06efab29.4"]: Refreshing state... [id=b9fd1c6b3a86b4a79ef4341b5e34f29b]
cloudflare_record.oldbigbuddhadev_cname_www: Refreshing state... [id=b25791d161fdcbcc6bfb30b3b3b76d1f]
cloudflare_record.oldbigbuddhanet_mx_root3: Refreshing state... [id=7e83a273ed31c5bbe5fed969798e52ea]
cloudflare_record.roppojsondev_cname_api: Refreshing state... [id=762933d5414c910923416948c1472d65]
cloudflare_record.oldbigbuddhadev_txt_googledomainkey: Refreshing state... [id=4e34c312aaab56ceee8506db13088f5d]
cloudflare_record.oldbigbuddhanet_mx_root5: Refreshing state... [id=45c71eba41caf9b7d4b880034f353a02]
cloudflare_record.oldbigbuddhadev_a_sample: Refreshing state... [id=006013a1b3a01ea8f837b7a3e6e4396d]
cloudflare_record.oldbigbuddhadev_mx_root1: Refreshing state... [id=837d0e880da0bb04feae611b26e7da29]
cloudflare_record.oldbigbuddhadev_a_root: Refreshing state... [id=729bc4ba17a08bc95eaaac1eb98eeda4]
cloudflare_record.roppojsondev_a_root4: Refreshing state... [id=e5b705c2c09d6878a422af80ce990b00]
cloudflare_record.oldbigbuddhadev_txt_root_spf: Refreshing state... [id=8c025269b0c25683c88dd3c352e4161d]
cloudflare_record.oldbigbuddhanet_txt_googledomainkey: Refreshing state... [id=9cc6202c5caf48a883219dfd10411739]
cloudflare_record.oldbigbuddhanet_txt_root_spf: Refreshing state... [id=32a246e34fdc70f5c0fa61d1ea30fd7e]
cloudflare_record.oldbigbuddhadev_mx_root5: Refreshing state... [id=61684a48eb4ee121aa515cd598b998b8]
cloudflare_record.roppojsondev_txt_root_github_challenge: Refreshing state... [id=db0d8e71cfa6c02633ffe88270ac1689]
cloudflare_record.oldbigbuddhadev_mx_root2: Refreshing state... [id=b41eaebef9ae6f583cf2eecbb9b92df9]
cloudflare_record.roppojsondev_a_root3: Refreshing state... [id=9967cf487501a2228f6820ef223a7c96]
cloudflare_record.oldbigbuddhadev_txt_keybase: Refreshing state... [id=ad06bb7a06097273f4a03707624f8b71]
cloudflare_record.oldbigbuddhadev_mx_root3: Refreshing state... [id=fb6db40c9f292324f2b12fd9d16ca982]
cloudflare_record.oldbigbuddhanet_txt_dmarc: Refreshing state... [id=0cfd90ff41ee1fe03a73773a8afb7272]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.ojilabcloud_txt_access_demo will be destroyed
  # (because cloudflare_record.ojilabcloud_txt_access_demo is not in configuration)
  - resource "cloudflare_record" "ojilabcloud_txt_access_demo" {
      - created_on  = "2024-03-22T12:54:25.666616Z" -> null
      - hostname    = "_github-pages-challenge-oldbigbuddha.access-demo.ojilab.cloud" -> null
      - id          = "b6973f3066c3bee885f4a63848ed8ae0" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2024-03-22T12:54:25.666616Z" -> null
      - name        = "_github-pages-challenge-oldbigbuddha.access-demo" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "c2844569820fc5a1fb0d4a67a700eb" -> null
      - zone_id     = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.ojilabcloud_txt_root_googlesiteverification will be destroyed
  # (because cloudflare_record.ojilabcloud_txt_root_googlesiteverification is not in configuration)
  - resource "cloudflare_record" "ojilabcloud_txt_root_googlesiteverification" {
      - created_on  = "2022-03-11T00:53:20.202641Z" -> null
      - hostname    = "ojilab.cloud" -> null
      - id          = "d287e1bceb9844e362caffefcc302e0c" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2022-03-11T00:53:39.119855Z" -> null
      - name        = "ojilab.cloud" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0" -> null
      - zone_id     = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.5"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-oldbigbuddha.access-demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "c2844569820fc5a1fb0d4a67a700eb"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.6"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ojilab.cloud"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

</details>
*Pusher: @OldBigBuddha, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*